Public Attributes | List of all members
API_ShellQuantity Struct Reference
Element Manager API
Returns the shell quantity values. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | referenceSurface
Net area of the reference surface (without holes).
double  | oppositeSurface
Net area of the surface opposite to the reference (without holes).
double  | edgeSurface
Total are of the edges.
double  | referenceSurface_cond
Conditional area of the reference surface.
double  | oppositeSurface_cond
Conditional area of the opposite surface.
double  | volume
Volume of the shell.
double  | volume_cond
Conditional volume of the shell.
double  | perimeter
Perimeter of the contour polygon.
double  | holesSurf
Total area of the holes.
double  | holesPrm
Total perimeter of the holes.
double  | grossReferenceSurf
Gross reference surface area (holes included).
double  | grossOppositeSurf
Gross area of the opposite surface (holes included).
double  | grossEdgeSurf
Gross area of the edge surface.
double  | grossVolume
Gross volume of the shell (holes included).
double  | insuThickness
Insulation thickness of the shell.
double  | ridgesLength
Total length of the ridges.
double  | valleysLength
Total length of the valleys.
double  | gablesLength
Total length of the gables.
double  | hipsLength
Total length of the hips.
double  | eavesLength
Total length of the eaves.
double  | peaksLength
Total length of the peaks.
double  | sideWallConLength
Total length of the connecting line with side walls.
double  | endWallConLength
Total length of the connecting line with wall ends.
double  | domeConLength
Total length of the connecting line with domes.
double  | hollowConLength
Total length of the connecting line with hollows.
double  | openingSurf
Total area of the openings.
double  | floorplanArea
Projected floor plan area of the contour polygon.
Int32  | numOfHoles
Number of holes in contour polygon.
Int32  | numOfSkylight
Number of skylight.
Detailed Description
Returns the shell quantity values.
Member Data Documentation
◆ domeConLength
 API_ShellQuantity::domeConLength
Total length of the connecting line with domes.
◆ eavesLength
 API_ShellQuantity::eavesLength
Total length of the eaves.
◆ edgeSurface
 API_ShellQuantity::edgeSurface
Total are of the edges.
◆ endWallConLength
 API_ShellQuantity::endWallConLength
Total length of the connecting line with wall ends.
◆ floorplanArea
 API_ShellQuantity::floorplanArea
Projected floor plan area of the contour polygon.
◆ gablesLength
 API_ShellQuantity::gablesLength
Total length of the gables.
◆ grossEdgeSurf
 API_ShellQuantity::grossEdgeSurf
Gross area of the edge surface.
◆ grossOppositeSurf
 API_ShellQuantity::grossOppositeSurf
Gross area of the opposite surface (holes included).
◆ grossReferenceSurf
 API_ShellQuantity::grossReferenceSurf
Gross reference surface area (holes included).
◆ grossVolume
 API_ShellQuantity::grossVolume
Gross volume of the shell (holes included).
◆ hipsLength
 API_ShellQuantity::hipsLength
Total length of the hips.
◆ holesPrm
 API_ShellQuantity::holesPrm
Total perimeter of the holes.
◆ holesSurf
 API_ShellQuantity::holesSurf
Total area of the holes.
◆ hollowConLength
 API_ShellQuantity::hollowConLength
Total length of the connecting line with hollows.
◆ insuThickness
 API_ShellQuantity::insuThickness
Insulation thickness of the shell.
◆ numOfHoles
 API_ShellQuantity::numOfHoles
Number of holes in contour polygon.
◆ numOfSkylight
 API_ShellQuantity::numOfSkylight
Number of skylight.
◆ openingSurf
 API_ShellQuantity::openingSurf
Total area of the openings.
◆ oppositeSurface
 API_ShellQuantity::oppositeSurface
Net area of the surface opposite to the reference (without holes).
◆ oppositeSurface_cond
 API_ShellQuantity::oppositeSurface_cond
Conditional area of the opposite surface.
◆ peaksLength
 API_ShellQuantity::peaksLength
Total length of the peaks.
◆ perimeter
 API_ShellQuantity::perimeter
Perimeter of the contour polygon.
◆ referenceSurface
 API_ShellQuantity::referenceSurface
Net area of the reference surface (without holes).
◆ referenceSurface_cond
 API_ShellQuantity::referenceSurface_cond
Conditional area of the reference surface.
◆ ridgesLength
 API_ShellQuantity::ridgesLength
Total length of the ridges.
◆ sideWallConLength
 API_ShellQuantity::sideWallConLength
Total length of the connecting line with side walls.
◆ valleysLength
 API_ShellQuantity::valleysLength
Total length of the valleys.
◆ volume
 API_ShellQuantity::volume
Volume of the shell.
◆ volume_cond
 API_ShellQuantity::volume_cond
Conditional volume of the shell.